#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # newrelic_one_dashboard.meal_planner will be created
  + resource "newrelic_one_dashboard" "meal_planner" {
      + account_id  = (known after apply)
      + guid        = (known after apply)
      + id          = (known after apply)
      + name        = "Example Dashboard"
      + permalink   = (known after apply)
      + permissions = "public_read_only"

      + page {
          + guid = (known after apply)
          + name = "Example Dashboard"

          + widget_billboard {
              + column = 1
              + height = 2
              + id     = (known after apply)
              + row    = 1
              + title  = "Core web vitals - LCP"
              + width  = 2

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = <<-EOT
                                  SELECT percentile(largestContentfulPaint, 75)
                                  FROM PageViewTiming
                                  WHERE appName = 'meal-planner'
                    EOT
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @pmclain, Action: `pull_request`*